----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 300, 300]             320
         MaxPool2d-2         [-1, 32, 150, 150]               0
       BatchNorm2d-3         [-1, 32, 150, 150]              64
            Conv2d-4         [-1, 64, 150, 150]          18,496
         MaxPool2d-5           [-1, 64, 75, 75]               0
       BatchNorm2d-6           [-1, 64, 75, 75]             128
            Conv2d-7          [-1, 128, 75, 75]          73,856
       BatchNorm2d-8          [-1, 128, 75, 75]             256
       BatchNorm2d-9          [-1, 128, 75, 75]             256
             ReLU-10          [-1, 128, 75, 75]               0
           Conv2d-11           [-1, 64, 75, 75]          73,728
        OSAModule-12           [-1, 64, 75, 75]               0
      BatchNorm2d-13           [-1, 64, 75, 75]             128
             ReLU-14           [-1, 64, 75, 75]               0
           Conv2d-15           [-1, 64, 75, 75]          36,864
        OSAModule-16           [-1, 64, 75, 75]               0
      BatchNorm2d-17           [-1, 64, 75, 75]             128
             ReLU-18           [-1, 64, 75, 75]               0
           Conv2d-19           [-1, 64, 75, 75]          36,864
        OSAModule-20           [-1, 64, 75, 75]               0
      BatchNorm2d-21           [-1, 64, 75, 75]             128
             ReLU-22           [-1, 64, 75, 75]               0
           Conv2d-23           [-1, 64, 75, 75]          36,864
        OSAModule-24           [-1, 64, 75, 75]               0
      BatchNorm2d-25           [-1, 64, 75, 75]             128
             ReLU-26           [-1, 64, 75, 75]               0
           Conv2d-27           [-1, 64, 75, 75]          36,864
        OSAModule-28           [-1, 64, 75, 75]               0
         OSABlock-29          [-1, 320, 75, 75]               0
      BatchNorm2d-30          [-1, 320, 75, 75]             640
             ReLU-31          [-1, 320, 75, 75]               0
           Conv2d-32          [-1, 128, 75, 75]          40,960
  TransitionBlock-33          [-1, 128, 75, 75]               0
          Flatten-34                  [-1, 128]               0
           Linear-35                    [-1, 8]           1,032
             ReLU-36                    [-1, 8]               0
           Linear-37                  [-1, 128]           1,152
          Flatten-38                  [-1, 128]               0
           Linear-39                    [-1, 8]           1,032
             ReLU-40                    [-1, 8]               0
           Linear-41                  [-1, 128]           1,152
      ChannelGate-42          [-1, 128, 75, 75]               0
      ChannelPool-43            [-1, 2, 75, 75]               0
           Conv2d-44            [-1, 1, 75, 75]              98
      BatchNorm2d-45            [-1, 1, 75, 75]               2
        BasicConv-46            [-1, 1, 75, 75]               0
      SpatialGate-47          [-1, 128, 75, 75]               0
             CBAM-48          [-1, 128, 75, 75]               0
           Conv2d-49          [-1, 128, 75, 75]         147,584
     PixelShuffle-50         [-1, 32, 150, 150]               0
      BatchNorm2d-51         [-1, 32, 150, 150]              64
           Conv2d-52         [-1, 64, 150, 150]          18,496
     PixelShuffle-53         [-1, 16, 300, 300]               0
      BatchNorm2d-54         [-1, 16, 300, 300]              32
           Conv2d-55          [-1, 1, 300, 300]             145
           Conv2d-56          [-1, 1, 300, 300]             145
           Conv2d-57          [-1, 1, 300, 300]             145
           Conv2d-58          [-1, 1, 300, 300]             145
================================================================
Total params: 527,896
Trainable params: 527,896
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.34
Forward/backward pass size (MB): 241.92
Params size (MB): 2.01
Estimated Total Size (MB): 244.28
----------------------------------------------------------------
